akamud.vscode-caniuse
dbaeumer.vscode-eslint
editorconfig.editorconfig
esbenp.prettier-vscode
github.copilot
github.copilot-chat
github.vscode-pull-request-github
graphql.vscode-graphql
graphql.vscode-graphql-syntax
netflix.netflix-ide-plugin-vscode-dropship
pomdtr.excalidraw-editor
redhat.java
sonarsource.sonarlint-vscode
streetsidesoftware.code-spell-checker
styled-components.vscode-styled-components
stylelint.vscode-stylelint
unifiedjs.vscode-mdx
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vmware.vscode-boot-dev-pack
vmware.vscode-spring-boot
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscjava.vscode-spring-boot-dashboard
vscjava.vscode-spring-initializr
yzhang.markdown-all-in-one
