tap "homebrew/autoupdate"

# Core development tools
brew "git"
brew "gh"                    # GitHub CLI
brew "docker"
brew "docker-completion"

# Programming languages & package managers
brew "node"
brew "nvm"
brew "pnpm"
brew "pyenv"
brew "rbenv"
brew "go"
brew "rust"
brew "php"
brew "composer"

# Modern CLI replacements
brew "bat"                   # Enhanced cat
brew "eza"                   # Enhanced ls
brew "fd"                    # Enhanced find
brew "fzf"                   # Fuzzy finder
brew "ripgrep"               # Enhanced grep
brew "zoxide"                # Smart cd

# Development utilities
brew "jq"                    # JSON processor
brew "wget"
brew "curl"
brew "git-gui"
brew "diff-so-fancy"
brew "commitizen"
brew "gping"                 # Ping with graph
brew "tldr"                  # Simplified man pages
brew "scc"                   # Source lines counter
brew "entr"                  # File watcher
brew "ast-grep"              # Structural search for code

# Text editors
brew "vim"
brew "neovim"

# File management
brew "yazi"                  # Terminal file manager
brew "tree-sitter"

# Development workflow
brew "lazygit"               # Terminal Git UI

# Media processing
brew "ffmpeg"
brew "imagemagick"

# System utilities
brew "sevenzip"
brew "telnet"
brew "tesseract"            # OCR
brew "nginx"

# Applications
cask "1password"
cask "arc"
cask "claude"
cask "figma"
cask "google-drive"
cask "notion"
cask "raycast"
cask "rectangle"
cask "slack"
cask "spotify"
cask "stats"
cask "visual-studio-code"
cask "vlc"

# Fonts
cask "font-anonymice-nerd-font"
cask "font-symbols-only-nerd-font"
vscode "akamud.vscode-caniuse"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "pomdtr.excalidraw-editor"
vscode "redhat.java"
vscode "sonarsource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "yzhang.markdown-all-in-one"
