tap "homebrew/autoupdate"
brew "openssl@3"
brew "bat"
brew "readline"
brew "xz"
brew "cairo"
brew "commitizen"
brew "diff-so-fancy"
brew "docker"
brew "eza"
brew "fzf"
brew "giflib"
brew "git"
brew "gping"
brew "jpeg"
brew "pango"
brew "librsvg"
brew "nginx"
brew "node"
brew "nvm"
brew "pkgconf"
brew "pnpm"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "scc"
brew "tldr"
brew "vim"
brew "wget"
brew "zlib"
brew "zoxide"
cask "claude"
cask "figma"
cask "rectangle"
cask "vlc"
vscode "akamud.vscode-caniuse"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "netflix.netflix-ide-plugin-vscode-dropship"
vscode "pomdtr.excalidraw-editor"
vscode "redhat.java"
vscode "sonarsource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "yzhang.markdown-all-in-one"
